#include<graphics.h>
#include<Windows.h>


/*
int main(){
    initgraph(600,400);//定义绘图窗口大小

    loadimage(0,"bg.jpg");//加载图片

    settextstyle(30,0,"微软雅黑");//设置文本文体
    settextcolor(RGB(255,255,0));//设置字体颜色
    //画1个空心矩形，左上角坐标（300,40），右下角坐标（550，80）
    rectangle(300,40,550,80);//默认画笔颜色是白色，宽度也是默认的
    outtextxy(310,45,"1-网站 404攻击");//在矩形中打印文本

    rectangle(300,100,550,140);//默认画笔颜色是白色，宽度也是默认的
    outtextxy(310,105,"2-网站篡改攻击");//在矩形中打印文本

    rectangle(300,160,550,200);//默认画笔颜色是白色，宽度也是默认的
    outtextxy(310,165,"3-网站攻击修复");//在矩形中打印文本

    rectangle(300,220,550,260);//默认画笔颜色是白色，宽度也是默认的
    outtextxy(310,225,"4-查看攻击记录");//在矩形中打印文本

    rectangle(300,280,550,320);//默认画笔颜色是白色，宽度也是默认的
    outtextxy(310,285,"5-DNS攻击");//在矩形中打印文本

    rectangle(300,340,550,380);//默认画笔颜色是白色，宽度也是默认的
    outtextxy(310,345,"6-退出");//在矩形中打印文本

    system("pause");//暂停程序，使绘图窗口停留在屏幕
    closegraph();//

return 0;
}
*/
